fixture/vcr_cassettes/valid_invalid_with_requester_vat.json

[
  {
    "request": {
      "body": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:urn=\"urn:ec.europa.eu:taxud:vies:services:checkVat:types\">\n        <soapenv:Header/>\n        <soapenv:Body>\n          <urn:checkVatApprox>\n            <urn:countryCode>NL</urn:countryCode>\n            <urn:vatNumber>9999999</urn:vatNumber>\n            <urn:requesterCountryCode>IE</urn:requesterCountryCode>\n            <urn:requesterVatNumber>6388047V</urn:requesterVatNumber>\n          </urn:checkVatApprox>\n        </soapenv:Body>\n      </soapenv:Envelope>",
      "headers": {
        "SOAPAction": "",
        "Content-Type": "text/xml;charset=UTF-8"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://ec.europa.eu/taxation_customs/vies/services/checkVatService"
    },
    "response": {
      "binary": false,
      "body": "<env:Envelope xmlns:env=\"http://schemas.xmlsoap.org/soap/envelope/\"><env:Header/><env:Body><ns2:checkVatApproxResponse xmlns:ns2=\"urn:ec.europa.eu:taxud:vies:services:checkVat:types\"><ns2:countryCode>NL</ns2:countryCode><ns2:vatNumber>9999999</ns2:vatNumber><ns2:requestDate>2023-08-11+02:00</ns2:requestDate><ns2:valid>false</ns2:valid><ns2:traderName>---</ns2:traderName><ns2:traderCompanyType>---</ns2:traderCompanyType><ns2:traderAddress>---</ns2:traderAddress><ns2:requestIdentifier></ns2:requestIdentifier></ns2:checkVatApproxResponse></env:Body></env:Envelope>",
      "headers": {
        "Date": "Fri, 11 Aug 2023 11:23:10 GMT",
        "Content-Length": "567",
        "Content-Type": "text/xml; charset=UTF-8",
        "SOAPAction": "\"\"",
        "Accept": "text/xml",
        "Server": "Europa",
        "Proxy-Connection": "Keep-Alive",
        "Connection": "keep-alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]